Merge pull request #3 from truehazker/feature/refactor
refactor: :recycle: general refactoring and deps update
